//=============================================================================
//
// プレイヤー処理 [manu_game.h]
// Author : 
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************

enum
{

};


//*****************************************************************************
// 構造体定義
//*****************************************************************************

struct MENU_GAME
{
	XMFLOAT3	pos;		// ポリゴンの座標
	float		w, h;		// 幅と高さ
	int			texNo;		// 使用しているテクスチャ番号

	bool		flag;		// ゲームメニューの起動フラグ
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitMenuGame(void);
void UninitMenuGame(void);
void UpdateMenuGame(void);
void DrawMenuGame(void);

MENU_GAME* GetMenuGame(void);



